package com.bhupendra.joke;

import android.content.Intent;
import android.graphics.Color;
import android.graphics.drawable.ColorDrawable;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.util.Log;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.ImageView;
import android.widget.ListView;
import android.widget.TextView;
import android.widget.Toast;

import com.bumptech.glide.Glide;

import java.util.ArrayList;

public class jokemainActivity extends AppCompatActivity  {
    private static final String TAG = "jokemainActivity";

    //vars
    private ArrayList<String> mNames = new ArrayList<>();
    private ArrayList<String> mcount = new ArrayList<>();

    ListView lt;
    private  ImageView img;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_jokemain);


        Log.d(TAG, "onCreate: started.");

        img = findViewById(R.id.ch_lang_main);

        img.setOnClickListener( new View.OnClickListener() {

            @Override
            public void onClick(View v) {

                Intent s1= new Intent(jokemainActivity.this,LangSelectionActivity.class);
                startActivity(s1);
                finish();
            }
        });


        getIncomingIntent();
        TextView name = findViewById(R.id.cat_name);


        //initImageBitmaps();


    }

    private void getIncomingIntent(){
        Log.d(TAG, "getIncomingIntent: checking for incoming intents.");

        if( getIntent().hasExtra("image_name")){
            Log.d(TAG, "getIncomingIntent: found intent extras.");

           // String imageUrl = getIntent().getStringExtra("image_url");
            String imageName = getIntent().getStringExtra("image_name");

            setImage( imageName);

           if (imageName.equals("डाक्टर"))
           {
               //Toast.makeText(this, "hello डाक्टर", Toast.LENGTH_SHORT).show();
               डाक्टर();
           }
            if (imageName.equals("शराबी"))
            {
                //Toast.makeText(this, "hello शराबी", Toast.LENGTH_SHORT).show();
                शराबी();
            }
            if (imageName.equals("शिक्षक छात्र चुटकुले"))
            {
                //Toast.makeText(this, "hello शिक्षक छात्र चुटकुले", Toast.LENGTH_SHORT).show();
                शिक्षकछात्रचुटकुले();
            }
            if (imageName.equals("बच्चों के लिए चुटकुले"))
            {
                //Toast.makeText(this, "hello बच्चों के लिए चुटकुले", Toast.LENGTH_SHORT).show();
                बच्चों_के_लिए_चुटकुले();
            }
            if (imageName.equals("पति पत्नी चुटकुले"))
            {
                //Toast.makeText(this, "hello पति पत्नी चुटकुले", Toast.LENGTH_SHORT).show();
                पति_पत्नी_चुटकुले();
            }
            if (imageName.equals("संता-बंता"))
            {
                //Toast.makeText(this, "hello संता-बंता", Toast.LENGTH_SHORT).show();
                संता_बंता();
            }
            if (imageName.equals("मजेदार चुटकुले"))
            {
                //Toast.makeText(this, "hello मजेदार चुटकुले", Toast.LENGTH_SHORT).show();
                मजेदार_चुटकुले();
            }
            if (imageName.equals("अकबर बीरबल"))
            {
                //Toast.makeText(this, "hello अकबर बीरबल", Toast.LENGTH_SHORT).show();
                अकबर_बीरबल();
            }
            if (imageName.equals("राजनीति"))
            {
                //Toast.makeText(this, "hello राजनीति", Toast.LENGTH_SHORT).show();
                राजनीति();
            }
            if (imageName.equals("18+"))
            {
                //Toast.makeText(this, "hello राजनीति", Toast.LENGTH_SHORT).show();
                //joke_18();
                CustomDialogClass cdd = new CustomDialogClass(jokemainActivity.this);
                cdd.getWindow().setBackgroundDrawable(new ColorDrawable(Color.TRANSPARENT));
                cdd.show();
                joke_18();
            }

            //english

            if (imageName.equals("Bar Jokes"))
            {
                //Toast.makeText(this, "hello राजनीति", Toast.LENGTH_SHORT).show();
                Bar_joke();
            }
            if (imageName.equals("Funniest jokes"))
            {
                //Toast.makeText(this, "hello राजनीति", Toast.LENGTH_SHORT).show();
                Funniest_jokes();
            }



           else
           {
               //Toast.makeText(this, "no?????", Toast.LENGTH_SHORT).show();
           }
        }
    }




    private void setImage( String imageName){
        Log.d(TAG, "setImage: setting te image and name to widgets.");

        TextView name = findViewById(R.id.cat_name);
        name.setText(imageName);


    }

    // डाक्टर
    private void डाक्टर(){
        Log.d(TAG, "initImageBitmaps: preparing bitmaps.");

        mNames.add("डॉक्टर :-तबियत कैसी है..?\n" +
                "\n" +
                "मरीज़ :-पहले से ज्यादा खराब है…\n" +
                "\n" +
                "डॉक्टर :-दवाई खा ली थी.?\n" +
                "\n" +
                "मरीज़ :-खाली नहीं थी भरी हुई थी…\n" +
                "\n" +
                "डॉक्टर :- मेरा मतलब है दवाई ले ली थी.?\n" +
                "\n" +
                "मरीज़ :-जी आप ही से तो ली थी…\n" +
                "\n" +
                "डाक्टर :-बेवक़ूफ़ !! दवाई पी ली थी.?\n" +
                "\n" +
                "मरीज़ :-नहीं जी,, दवाई नीली थी…\n" +
                "\n" +
                "डॉक्टर :-अबे गधे !! दवाई को पी लिया था.?\n" +
                "\n" +
                "मरीज़ :-नहीं जी,, पीलिया तो मुझे था…\n" +
                "\n" +
                "डॉक्टर :-उल्लू के पट्ठे !! दवाई को खोल के मुँह में रख लिया था.?\n" +
                "\n" +
                "मरीज़ :-नहीं आप ही ने तो कहा था कि फ्रिज में रखना…..\n" +
                "\n" +
                "डॉक्टर :-अबे क्या मार खायेगा..?\n" +
                "\n" +
                "मरीज़ :-नहीं दवाई खाऊंगा…\n" +
                "\n" +
                "डॉक्टर :-निकल साले, तू पागल कर देगा…\n" +
                "\n" +
                "मरीज़ :-जा रहा हूँ, फिर कब आऊँ..?\n" +
                "\n" +
                "डॉक्टर :-मरने के बाद…\n" +
                "\n" +
                "मरीज़ :-मरने के कितने दिन बाद.?\n" +
                "\n" +
                "डॉक्टर बेहोश।");
        mcount.add("01");


        mNames.add("आँख का डॉक्टर :\n" +
                "(लेडी पेशेंट की आँखें चैक करते हुए)\n" +
                "\n" +
                "डॉक्टर :\n" +
                "मैडम….अपने हसबेंड को जैसे देखती हो वैसे देखो।\n" +
                "\n" +
                "लेडी : लेकिन क्यों ?\n" +
                "डॉक्टर : आँखों मे आई ड्राप डालना है!");
        mcount.add("02");




        mNames.add("संता, डॉक्टर से:\n" +
                "जब मैं सोता हूँ तो सपने में बन्दर फुटबॉल खेलते हैं ।\n" +
                "\n" +
                "डॉक्टर:\n" +
                "कोई दिक्कत नहीं, ये गोली रात को सोने से पहले खा लेना ।\n" +
                "\n" +
                "संता:\n" +
                "कल से खाऊंगा, आज तो फाइनल हैं");
        mcount.add("03");



        mNames.add("ऑपरेशन टेबल पर लेटा हुआ मरीज़ :\n" +
                "\n" +
                "डॉक्टर साहब, हॉस्पिटल में कब तक रुकना पड़ेगा ??\n" +
                "\n" +
                "डॉक्टर : ऑपरेशन ठीक हुआ तो एक सप्ताह…\n" +
                "\n" +
                "नहीं तो आधा घण्टा !!!ा");
        mcount.add("04");


        mNames.add("लड़की – मेरे चेहरे में जलन हो रही है\n" +
                "डॉक्टर – आपके चेहरे का हमें एक्स रे करना पड़ेगा\n" +
                "\n" +
                "लड़की – एक्स रे में क्या होता है\n" +
                "डॉक्टर – चेहरे की फोटो खींची जाती है..\n" +
                "\n" +
                ".\n" +
                "\n" +
                "लड़की – 5 मिनट रुको मैं मेकअप कर लूं \n" +
                "डॉक्टर बेहोश");
        mcount.add("05");



        mNames.add("डॉक्टर : डिप्रेशन की पेशेंट से-\n" +
                "\n" +
                "क्या तकलीफ़ है..?\n" +
                "\n" +
                "लेडी पेशेंट : सर, दिमाग में बहुत उल्टे पुलटे विचार आते हैं, रुकते ही नहीं…\n" +
                "\n" +
                "डॉक्टर : कैसे विचार आते हैं ..?\n" +
                "\n" +
                "लेडी पेशेंट : जैसे अब मैं यहाँ आई हूँ तो आपके ओपीडी में एक भी पेशेंट नहीं था.. तो मैं सोचने लगी कि डॉक्टर साहब के पास कोई भी पेशेंट नहीं है, इनकी कमाई कैसे होगी, घर कैसे चलेगा, इतना पैसा डाला पढ़ाई में, अब क्या करेंगे.. हॉस्पिटल बनाने में भी बहुत पैसा लगाया होगा, अब लोन कैसे चुकाएंगे ? कहीं किसानों के माफ़िक लटक तो नहीं जाएंगे एक दिन…!! ऐसे कुछ भी विचार आते रहते हैं…\n" +
                "\n" +
                "अब डॉक्टर डिप्रेशन मे है।");
        mcount.add("06");


        mNames.add("डॉक्टर – आपको क्या बिमारी है ?\n" +
                "\n" +
                "मरीज़ – पहले आप वादा करो की हंसोगे नहीं ।\n" +
                "\n" +
                "डॉक्टर – OK…Promise…\n" +
                "\n" +
                "मरीज़ ने अपनी टांगे दिखाई जो माचिस की तीली जितनी पतली थी ।\n" +
                "\n" +
                "डॉक्टर को यह देख के हंसी आ गयी ।\n" +
                "\n" +
                "मरीज़ – आपने ना हंसने का वादा किया था ।\n" +
                "\n" +
                "डॉक्टर – अच्छा Sorry…\n" +
                "अब तकलीफ बताओ ।\n" +
                "\n" +
                "मरीज़ – डॉक्टर साहब, यह सूज गयी है ।\n" +
                "\n" +
                "डॉक्टर – हाहाहाहा… भाग साले…\n" +
                "तू आया ही हंसाने के लिए है…");
        mcount.add("07");


        mNames.add("एक राजस्थानी एक डॉक्टर से बोला:\n" +
                "डॉक्टर साहब आप घर चलने की कितनी फीस लेते हो ?\n" +
                "\n" +
                "डॉक्टर: तीन सौ रुपये\n" +
                "\n" +
                "राजस्थानी:\n" +
                "ठीक है… चलो डॉक्टर साहब.\n" +
                "\n" +
                "डॉक्टर ने अपनी गाड़ी निकाली\n" +
                "और राजस्थानी के साथ उसके घर आ गया !\n" +
                "\n" +
                "डॉक्टर बोला: मरीज कहाँ है?\n" +
                "\n" +
                "राजस्थानी:\n" +
                "मरीज कोई नहीं है साहब ….\n" +
                "टैक्सी वाला पांचसौ रुपये मांग रहा था\n" +
                "और आप तीनसाै में ले आये ! ");
        mcount.add("08");

        initRecyclerView();
    }

    //  शराबी
    private void शराबी(){
        Log.d(TAG, "initImageBitmaps: preparing bitmaps.");

        mNames.add("कल, भारतीय रिज़र्व बैंक के गवर्नर ने कहा, अर्थव्यवस्था में सुधार के लिए दो से तीन क्वार्टर तक लग जाएगा।\n" +
                "\n" +
                "इसलिए मैंने कल रात 2 क्वार्टर खरीदे आखिरकार, मेरा भी कुछ कर्तव्य है देश के प्रति\n" +
                "\n" +
                "सुबह उठा; कुछ भी नहीं बदला था!\n" +
                "\n" +
                "आज 3 क्वार्टर के साथ फिर प्रयास करूंगा!");
        mcount.add("01");

        mNames.add("पुलिसवाले ने पूछा – इतनी क्यूँ पी रखी है ??\n" +
                "\n" +
                "शराबी –\n" +
                "क्या करूँ,\n" +
                "मजबूरी थी!\n" +
                "\n" +
                "पुलिसवाला – कैसी मजबूरी ??\n" +
                "\n" +
                "शराबी – बोतल का ढक्कन गुम हो गया था!");
        mcount.add("02");

        mNames.add("एक औरत ने भी हद कर दी…\n" +
                "उसने मोदी जी को एक पत्र लिखा\n" +
                "जिसमे एक योजना बताई की दारू की दाम दुगनी कर के दारू की दूकान को आधार कार्ड से जोड़ दे\n" +
                "और आधा पैसा पीने वाले की पत्नी के अकाउंट में सब्सिडी की तरह वापस कर देना चाहिए\n" +
                "\n" +
                "जिससे ये फायदे होंगे !\n" +
                "1. पति लिमिट में पियेगा, क्योंकि उसके नशे की मात्रा उसकी पत्नी के बैंक बैलेंस के बराबर रहेगी ।\n" +
                "2. पत्निया पीने के लिए कभी मना नही करेंगी ।\n" +
                "3. पत्नी को मालूम रहेगा, आज पति ने कितनी पी ।\n" +
                "4. जिस की पत्नी का अकाउंट नहीं है वो भी खुल जाएगा ।\n" +
                "\n" +
                "( हो सकता है किसी किसी की पत्नी को आयकर – रिटर्न भी दाखिल करना पड़े )\n" +
                "\n" +
                "नई सोच को सलाम!!ं");
        mcount.add("03");

        mNames.add("बाबा रामदेव ने कहा\n" +
                "“ठण्ड से बचने के लिए पानी मैं\n" +
                "आजवाइन डालकर पिए ”\n" +
                "\n" +
                "कुछ भक्तों ने ये समझा पानी मैं\n" +
                "आज Wine डालकर पियें।\n" +
                "\n" +
                "अब सब अच्छा फील कर रहे हैं।");
        mcount.add("04");


        mNames.add("शर्मा जी की छत टपक रखी थी ठीक डाइनिंग टेबल के ऊपर…\n" +
                "\n" +
                "पलंबर ने पूछा – आपको कब पता चला ?\n" +
                "\n" +
                "शर्मा जी – कल रात को जब मेरा पैग तीन घंटे तक ख़त्म नहीं हुआ..");
        mcount.add("05");

        mNames.add("शराबी चाहे कितना भी अनपढ क्यों न हो,\n" +
                "\n" +
                "Quarter के तीन पेग ऐसे बनाता है,\n" +
                "\n" +
                "जैसे किसी प्रयोगशाला का बहुत बडा Scientist हो!!");
        mcount.add("06");

        mNames.add("Motivational Message –\n" +
                "\n" +
                "व्यायाम करना, शराब न पीना, शाकाहारी होना आपकी उम्र में कुछ और साल तो जोड़ सकता है,\n" +
                "पर ध्यान रहे, ये साल आपके\n" +
                "बुढ़ापे के जुड़ेंगे ना की जवानी के…!!");
        mcount.add("07");

        mNames.add("पति ने पत्नी को मेसेज भेजा-\n" +
                "मेरी जिंदगी इतनी प्यारी, इतनी खूबसूरत बनाने के लिए तुम्हारा शुक्रिया।\n" +
                "मैं आज जो भी हूं, सिर्फ तुम्हारी वजह से हूं।\n" +
                "तुम मेरे जीवन में एक फरिश्ता बनकर आई हो\n" +
                "और तुमने ही मुझे जीने का मकसद दिया है। लव यू..’\n" +
                "\n" +
                "पत्नी ने रिप्लाई किया-\n" +
                "मार लिया चौथा पैग? आ जाओ घर कुछ नही कहूँगी। :\n" +
                "\n" +
                "पति – बाहर खड़ा हूँ, गेट खोल दे!");
        mcount.add("08");

        mNames.add("एक शराबी अपने दोस्त से –\n" +
                "आज तब तक पीयेंगे जब तक वो सामने वाले 3 पेड़ 6 नही दिखने लगें।\n" +
                "\n" +
                "बार टेंडर –\n" +
                "बस करो कमीनो….\n" +
                "सामने एक ही पेड़ है….\n" +
                "अब क्या जंगल बनाओगे…!!!");
        mcount.add("09");
        mNames.add("मैथमेटिक्स में हमेशा फ़ैल होने वाले भी….\n" +
                "\n" +
                "एक क्वार्टर के तीन पेग ऐसे बनाते है जैसे वो किसी लैब में साइंटिस्ट हो!");
        mcount.add("10");
        mNames.add("हरीलाल का पेट खराब था…\n" +
                "\n" +
                "पत्नी बोली – “आजवाइन ले लो.”\n" +
                "\n" +
                "हरीलाल -शाम को टुन्न होकर घर आया\n" +
                "\n" +
                "तो पत्नी बोली — यह क्या है…..\n" +
                "\n" +
                "हरीलाल — वही जो तूने सुबह कहा था कि\n" +
                "“आज वाइन ले लो” ");

        mcount.add("11");

        mNames.add("हशराबियों की दावत!\n" +
                "\n" +
                "एक शराबी ने दोस्तों के लिए दारु की दावत का प्रोग्राम बनाया,\n" +
                "दारू के बाद दोस्तों ने मटन खाने की इच्छा की ।\n" +
                "\n" +
                "पीने के बाद तो सभी शराबी दानवीर करन बन जाते है\n" +
                "तो शराबी ने अपने ही घर से रात को बकरा चोरी किया।\n" +
                "\n" +
                "रात को अपने दोस्तों के साथ खूब\n" +
                "दावत का मजा लिया और सुबह जब घर पहुंचा\n" +
                "तो बकरा घर में ही था।\n" +
                "\n" +
                "यह देख उसने बीवी से पूछा,\n" +
                "“ये बकरा कहाँ से आया?”\n" +
                "\n" +
                "बीवी बोली, “बकरे को मारो गोली,\n" +
                "ये बताओ रात को तुम चोरों की तरह\n" +
                "कुत्ते को कहाँ ले गए थे?");

        mcount.add("12");

        initRecyclerView();
    }



    //     शिक्षकछात्रचुटकुले

    private void शिक्षकछात्रचुटकुले(){
        Log.d(TAG, "initImageBitmaps: preparing bitmaps.");


        mNames.add("Teacher:- न्यूटन का नियम बताओ..\n" +
                "पप्पु :- सर पूरी लाइन तो याद नहीं,, लास्ट का याद है.\n" +
                "Teacher :- चलो लास्ट का ही सुनाओ\n" +
                "पप्पु : …और इसे ही न्यूटन का नियम कहते है.\n" +
                "Teacher: Get out.....");
        mcount.add("01");
        mNames.add("Teacher -  घर की परभाषा बताओ ।\n" +
                "Pappu - जो घर हौसले से बनाये जाते हैं उसे *\"हाऊस\"* कहते हैं...\n" +
                "जिन घरों में होम-हवन होते हैं उन्हें *\"होम\"*कहते हैं...\n" +
                "जिन घरों में हवा ज्यादा चलती है उन्हें *\"हवेली\"*कहते हैं...\n" +
                "जिन घरों में दीवारों के भी कान होते हैं उन्हें *\"मकान\"* कहते हैं...और\n" +
                "जिन घरों के लोन के इंस्टॉलमेंट भरते-भरते आदमी लेट जाता है उन्हें *\"फ्लैट\"* कहते हैं...\n" +
                "और जिन घरों में यह भी न पता हो कि बगल के घर में कौन रहता है उन्हें *\"बंगला\"* कहतेहैं।\n" +
                "\n" +
                "पप्पू को student of the year चुना गया");
        mcount.add("02");
        mNames.add("Teacher : सभी लड़कियो को बहन मानो..\n" +
                "Pappu : मैं तो नहीं मानूंगा....\n" +
                "Teacher : क्यों.....???\n" +
                "Pappu : शादी का ख़र्चा और दहेज क्या तेरा बाप भरेगा...");
        mcount.add("03");
        mNames.add("अध्यापक Pappu से:\n" +
                "आयात और निर्यात का एक अच्छा सा उदाहरण बताओ.\n" +
                "Pappu: सोनिया गांधी और सानिया मिर्ज़ा..\n" +
                "अध्यापक :\n" +
                "तुम्हारे चरण कहाँ हैं बेटा ।");
        mcount.add("04");
        mNames.add("भूगोल पढ़ाने वाली एक Teacher बहुत दुबली-पतली थी। \n" +
                "उसकी पोस्टिंग एक गांव में हो गई।\n" +
                "एक दिन वो क्लास में बच्चों से प्रश्न पूछ रही थी....\n" +
                "बताओ बच्चों, \n" +
                "धरती घूमती हुई क्यों नजर आती है?\n" +
                "Pappu:-.\n" +
                "मैडम जी कुछ खा लिया करो। बिना खाए स्कूल आओगी तो धरती ऐसे ही घूमेगी।");
        mcount.add("05");

        mNames.add("Pappu: सर जो मैं पढ़ता हूं, \n" +
                "मुझे याद ही नहीं रहता।\n" +
                ".\n" +
                "Teacher : अच्छा बताओ, \n" +
                "पिछली बार तू मेरे हाथों से कब पिटा था?\n" +
                ".\n" +
                "Pappu : पिछले शुक्रवार को।\n" +
                ".\n" +
                "Teacher : यह कैसे याद है?\n" +
                ".\n" +
                "Pappu: सर मुझे प्रैक्टिकल में नहीं, थ्योरी में प्रॉब्लम है। ");
        mcount.add("06");

        mNames.add("अध्यापक - बोलो बच्चों गंगा नदी पटियाला से निकलती है |\n" +
                "\n" +
                "भावना (छात्रा ) - सर नहीं गंगा नदी पटियाला से नहीं निकलती |\n" +
                "\n" +
                "प्रिंसिपल - महोदय आप भी कैसे अध्यापक है | गंगा नदी पटियाला से नहीं गंगोत्री से निकलती है |\n" +
                "\n" +
                "अध्यापक - प्रिंसिपल महोदय , गंगा नदी पटियाला से ही निकलती है तथा तब तक निकलती रहेगी , जब तक मेरी सात महीने की तनखाह नहीं मिल जाती | ");
        mcount.add("07");
        mNames.add("टीचर: तुम पढ़ने में ध्यान क्यों नहीं देते हो?\n" +
                "स्टूडेंट : क्योंकि पढाई सिर्फ दो वजहों से की जाती है…..\n" +
                "पहला कारण :डर से\n" +
                "दूसरा कारण : शौख़ से\n" +
                "और,बिना वजह के शौख हम रखते नहीं और डरते तो किसी के बाप से नहीं। ");
        mcount.add("08");
        mNames.add("टीचर – विनोद, एक मुर्गी रोज दो अण्डे दे तो वह सप्ताह मे कितने अंडे देगी?\n" +
                "\n" +
                "विनोद – सर, बारह ।\n" +
                "\n" +
                "टीचर – वह कैसे।\n" +
                "\n" +
                "विनोद – जी- वह रविवार की छुट्टी भी तो मनाएगी न सर");
        mcount.add("09");
        mNames.add("टीचर – इतने दिनों से कहाँ थे?\n" +
                "\n" +
                "पककू – बर्ड फ्लू था!\n" +
                "\n" +
                "टीचर – पर ये तो बर्ड को होता है!\n" +
                "\n" +
                "पककू (गुस्से में) – इंसान समझा ही कहाँ है आपने, रोज़ तो मुर्गा बनाते हो!");
        mcount.add("10");
        mNames.add("टीचर – इसे पूरा करो! 900 चूहे खा के, बिल्ली ____ चली?\n" +
                "\n" +
                "पककू – 900 चूहे खा के, बिल्ली टेडी टेडी चली?\n" +
                "\n" +
                "टीचर – ओये! तुझे पता नहीं इसका जवाब?\n" +
                "\n" +
                "पककू – आपके साथ तो मैंने फिर भी लिहाज कर लिया, नहीं तो 900 चूहे खा के बिल्ली चल भी नहीं सकती!");
        mcount.add("11");
        mNames.add("टीचर – अगर इरादा पक्का हो तो जो हासिल करना चाहो वो ज़रूर मिलता है!\n" +
                "\n" +
                "पंकज – रहने दो मिस, और अगर ऐसा होता तो आप मेरी मिस नहीं मिसिज़ होती!");
        mcount.add("12");
        mNames.add("टीचर – “ हर सफल आदमी के पीछे एक औरत का हाथ होता है ” इस वाक्य से तुम क्या समझते हो ?\n" +
                "\n" +
                "चिंटू – यही कि किताबों में टाइम वेस्ट करने से बेहतर है किसी लड़की के पीछे जाना …. !");
        mcount.add("13");
        mNames.add("टीचर – तुम किस खानदान से हो ?\n" +
                "\n" +
                "राहुल – जानवरों के !\n" +
                "\n" +
                "टीचर – क्या मतलब ?\n" +
                "\n" +
                "राहुल – पापा मुझे उल्लू का पट्ठा, मम्मी मुझे गधा, दादाजी शेर का बेटा और दादीजी बन्दर कहती हैं …. !!!\n" +
                ".");
        mcount.add("14");


        initRecyclerView();

    }

    private void बच्चों_के_लिए_चुटकुले(){
        Log.d(TAG, "initImageBitmaps: preparing bitmaps.");


        mNames.add("एक बहुत ही काला आदमी दुकान पे गया\n" +
                "\n" +
                "वो इतना काला था कि कोयला भी शरमा जाये\n" +
                "\n" +
                "और बोला –\n" +
                "\n" +
                "भैया गोरा होने की क्रीम है क्या ?\n" +
                "\n" +
                "दुकानदार – नहीं है\n" +
                "\n" +
                "आदमी – अच्छा तो जूता पॉलिश ही दे दो\n" +
                "\n" +
                "कम से कम चेहरे पे चमक तो बनी रहेगी");
        mcount.add("01");
        mNames.add("टीचर – “ख़ुशी का ठिकाना ना रहा”\n" +
                "इस मुहावरे का क्या मतलब है ?\n" +
                "\n" +
                "पप्पू – ख़ुशी घर वालों से छिपकर\n" +
                "रोजाना अपने बॉयफ्रेंड से मिलने जाती थी\n" +
                "\n" +
                "एक दिन उसके पापा ने बॉयफ्रेंड के साथ देख लिया\n" +
                "और ख़ुशी को घर से निकाल दिया\n" +
                "\n" +
                "अब बेचारी “ख़ुशी का ठिकाना ना रहा”" +
                "\n" +
                "टीचर बेहोश");
        mcount.add("02");
        mNames.add("पिता पुत्र से : आज तुम स्कूल क्यों नहीं गए ?\n" +
                "पुत्र : कल हम लोगों को स्कूल में तौला गया था। आज बेच दिया जाएगा। यही कारण है कि मैं आज स्कूल नहीं गया।");
        mcount.add("03");
        mNames.add("शिक्षक :(विद्यार्थी से) भारत वर्ष के मानचित्र में कुतुबमीनार कहां है ?\n" +
                "विद्यार्थी : पता नहीं सर।\n" +
                "शिक्षक : तो बैंच पर खड़े हो जाओ।\n" +
                "विद्यार्थी : (बेंच पर खड़ा होकर) सर ! यहां से भी कुतुबमीनार नहीं दिख रहा है। ");
        mcount.add("04");
        mNames.add("शपिताजी डांटते हुए- राजू तुम्हें फूल तोड़ लाने को कहा था और तुम पूरी डाली सहित तोड़ लाए, जल्दी बोलो कि क्यों ?\n" +
                "राजू- पिताजी, वहां लिखा था कि फूल तोड़ना मना है इसलिए मैं डाली सहित तोड़ लाया। ");
        mcount.add("05");
        mNames.add("महिला : तुमने मेरे बेटे की पिटाई क्यों की ? \n" +
                "मोटी महिला : उसने मुझे मोटी भैंस कहा था। \n" +
                "महिला : तो बहन, तुम्हें बेटे को पीटने के बजाय अपनी खुराक में कमी करनी चाहिए।  ");
        mcount.add("06");
        mNames.add("राजू : अगर प्रिंसिपल ने अपने शब्द वापस न लिए तो मैं स्कूल छोड़ दूंगा। \n" +
                "मोहन : क्या कहा था प्रिंसिपल ने ?\n" +
                "राजू : कहा था, स्कूल छोड़ दो।  ");
        mcount.add("07");
        mNames.add("माँ बेटे से : बेटे, घर में कायदे से रहना चाहिए। तुम्हें मेरी हर बात माननी चाहिए। \n" +
                "बेटे ने सिर हिलाते हुए कहा : मैं समझ गया मम्मी, जैसे पापा रहते हैं। ");
        mcount.add("08");

        initRecyclerView();

    }


    private void संता_बंता() {

        mNames.add("संता और बंता दोनों भाई एक\n" +
                "ही क्लास में पढ़ते थे।\n" +
                "\n" +
                "अध्यापिका: तुम दोनों ने अपने पापा का नाम अलग-अलग क्यों लिखा?\n" +
                "\n" +
                "संता: मैडम फिर आप कहोगे नक़ल मारी है, इसीलिए।");
        mcount.add("01");
        mNames.add("संता और बंता दोनों भाई एक ही क्लास में पढ़ते थे।\n" +
                "\n" +
                "अध्यापिका: तुम दोनों ने अपने पापा का नाम अलग-अलग क्यों लिखा?\n" +
                "\n" +
                "संता: मैडम फिर आप कहोगे नक़ल मारी है, इसीलिए।");
        mcount.add("02");
        mNames.add("बैंक मैनेजर:\n" +
                "कैश खत्म हो गया है कल आना\n" +
                "\n" +
                "संता:\n" +
                "लेकिन मुझे मेरे पैसे अभी चाहिये\n" +
                "\n" +
                "मैनेजर:\n" +
                "देखिये आप गुस्सा मत करिये,\n" +
                "शांति से बात कीजिये..\n" +
                "\n" +
                "संता:\n" +
                "ठीक है बुलाओ शांति को,\n" +
                "आज उसी से बात करूँगा !");
        mcount.add("03");
        mNames.add("बपल्स पोलिओ टीम घर आयी…\n" +
                "संता (बीबी से): बंदूक और कारतुस कहाँ हैं…??\n" +
                "\n" +
                "टीम भागी,\n" +
                "पीछे से संता ने आवाज दी,\n" +
                "\n" +
                "रुको\n" +
                "ओये रुको\n" +
                "ये हमारे बच्चो के नाम हैं.!!");
        mcount.add("04");
        mNames.add("संता ( पेट्रॉल पंप पर ) : अरे भाई , जरा एक रुपए का पेट्रॉल डाल दो।\n" +
                "\n" +
                "सेल्समैन : भाई , इतना पेट्रॉल डलवाकर जाना कहां है ?\n" +
                "\n" +
                "संता : अरे यार, कहीं नहीं जाना हम तो ऐसे ही पैसे उड़ाते रहते हैं..!!");
        mcount.add("05");


        initRecyclerView();



    }

    private void पति_पत्नी_चुटकुले() {

        mNames.add("पार्टी में सुन्दर लड़की से हंस हंस कर बातें कर रहे पति के पास पत्नी आई और बोली…..\n" +
                "चलिये, घर चल कर मैं आपकी चोट पे Moov लगा दूँगी।\n" +
                "पति : पर मुझे चोट कहाँ लगी है??\n" +
                "पत्नी: अभी हम घर भी कहाँ पहुंचे हैं????");
        mcount.add("01");
        mNames.add("पत्नी के काफी देर बाथरूम से नहीं निकलने पर...पती ने घबराकर दरवाजा खटखटाया ...\n" +
                "पत्नी की आवाज अंदर से बड़ी जोर से आवाज आई ,\n" +
                "खुश हैबै की कोई जरूरत नाय यहां कौन सौ बाथटब धरौ है, केवल मग्गा और बाल्टी है,,,\n" +
                "तुमाई श्रीदेवी आबई जिन्दा है ।");
        mcount.add("02");
        mNames.add("घर के बाहर इंतजार कर रहा पति बोला - अरे और कितनी देर लगाओगी ? \n " +
                "पत्नी ( गुस्से में ):- चिलाना बन्द करो ।\n " +
                "एक घण्टे से कह रही हूँ पांच मिन्ट में आ रही हूँ \n " +
                "समझ में नही आता क्या!!");
        mcount.add("03");
        mNames.add("पत्नि सो रही थी, उसके पैरो के पास एक नागिन कुण्डली लगा के बैठी थी।\n" +
                "\n" +
                "पति धीरे से बोला : डस ले…. डस ले….\n" +
                "\n" +
                "नागिन बोली:\n" +
                "कमीने!\n" +
                "चरण स्पर्श करने आई हूँ।\n" +
                "\n" +
                "गुरु हैं हमारी।\uD83D\uDE1B!");
        mcount.add("04");
        mNames.add("हरीश: तुम्हारी आंख क्यों सूजी हुई है ?\n" +
                "\n" +
                "पप्पू: कल मैं अपनी पत्नी के जन्मदिन पर केक लाया था।\uD83C\uDF82\n" +
                "\n" +
                "हरीश: लेकिन इसका आंख सूजने से क्या संबंध है?\n" +
                "\n" +
                "पप्पू: मेरी पत्नी का नाम तपस्या है लेकिन केक वाले बेवकूफ दुकानदार ने लिख दिया ….\n" +
                "\n" +
                "“हैप्पी बर्थडे समस्या”!!");
        mcount.add("05");
        mNames.add("एक औरत ने पंडित जी से घर की खुशहाली का उपाय पूंछा …\n" +
                "\n" +
                "पंडित जी .. बेटी पहली रोटी गाय को खिलाया करो और आखिरी रोटी कुत्ते को …\n" +
                "\n" +
                "औरत.. पंडित जी मैं ऐसा ही करती हूँ …\n" +
                "पहली रोटी खुद खाती हूँ …और …\n" +
                "\n" +
                "आखिरी रोटी अपने पति को खिलाती हूँ \uD83D\uDE00\n" +
                "\n" +
                "पंडित बेहोश!!");
        mcount.add("06");
        mNames.add("पत्नी -बाजार से दूध का एक पैकेट ले आऔ !\n" +
                "हां, अगर बाजार मे अंडे दिखे तो छः ले आना ।\n" +
                "पति छः पैकट दूध ले आया ।\n" +
                "पत्नी -छः पैकेट दूध ?\n" +
                "पति – हां छः पैकेट ही लाया हुं क्योंकि बाजार मे अंडे दिख गए थे !\n" +
                "\n" +
                "अब बताओ पति कहां पर गलत है ?\uD83E\uDD14!");
        mcount.add("07");
        mNames.add("बीवी पति से:\n" +
                "तुम ठीक से रहोगे तो बीजेपी के चुनाव चिन्ह से स्वागत करुँगी..!\n" +
                "\n" +
                "ज्यादा समझदारी दिखाई तो\n" +
                "फिर कांग्रेस के चुनाव चिन्ह से…!\n" +
                "\n" +
                "उसके बाद भी अकड़ोगे तो फिर…..\n" +
                "‘आप’ का चुनाव चिन्ह दरवाजे के पीछे रखा है…ध्यान रहे…!");
        mcount.add("08");


        initRecyclerView();


    }
    private void अकबर_बीरबल() {

        mNames.add("अकबर – बीरबल ,  कुछ ऐसा तरीका बताओ कि मैं खाऊं पियूँ तो बहुत…. पर मेरा रोज़ा ना  टूटे !!!!\n" +
                "\n" +
                "बीरबल – हुज़ूर, आप लोगो से लात घूसे खाओ और गुस्से को पी जाओ….\n" +
                "\n" +
                "…सब कुछ टूटेगा मगर रोज़ा नहीं टूटेगा !!");
        mcount.add("01");
        mNames.add("अकबर :  सेनापति..!  यह बताओ कि हम अनारकली को क्यों नहीं ढूंढ़ पा रहे हैं..??\n" +
                "\n" +
                "सेनापति : महाराज, क्योंकि हम मुगल हैं, गूगल नहीं…!!!");
        mcount.add("02");
        mNames.add("बादशाह  अकबर  बीरबल से  बोले  : बीरबल ! तुम्हारी  बीवी  बहुत  सुन्दर  है !!\n" +
                "\n" +
                "बीरबल  ने  कहा : हाँ  सरकार  ! मैं  भी  पहले  ऐसा  ही  समझता  था ,\n" +
                "\n" +
                "पर  जब से  बेगम  साहिबा  को  देखा  है, अपनी  बीवी  को  भूल  गया  हूँ !!\n" +
                "\n" +
                ".\n" +
                "\n" +
                ".\n" +
                "\n" +
                "इसके  बाद  बादशाह  अकबर  ने  बीरबल  की बीवी  के  बारे  में  कभी  मज़ाक  नहीं  किया !!");
        mcount.add("03");

        mNames.add("संता को मुगलों ने पकड़ लिया और उसे अकबर के पास ले गए…\n" +
                "\n" +
                "अकबर – कौन हो तुम ?\n" +
                "\n" +
                "संता – जहाँपनाह, मैं संता हूँ |\n" +
                "\n" +
                "अकबर – इतनी रात को तुम हमारे महल के पास क्या कर रहे थे ?\n" +
                "\n" +
                "संता – घबराते हुए ……… जी मैं ……… वो ……. कुछ नहीं ……… बस ऐसे ही ……..\n" +
                "\n" +
                "अकबर – सिपाहियों , इसको बंदी बना दिया जाए…\n" +
                "\n" +
                "संता – नहीं…नहीं जहांपनाह   !!! रहम !\n" +
                "\n" +
                "…..मुझे बंदा ही रहने दो।\n" +
                "\n");
        mcount.add("04");
        mNames.add("अकबर – हमारे अम्मी अब्बा हमसे इतनी मोहब्बत करते थे कि हमें सुलाने के लिए सारी सारी रात जागते थे और  हम फिर भी नहीं सोते थे !!\n" +
                "\n" +
                "बीरबल – हुज़ूर , तभी तो आप इकलौते रह गए !!");
        mcount.add("05");
        mNames.add("“अकबर ने बीरबल से तीन नये सवाल पूछे और कहा तीनों का जबाब एक ही होना चाहिये …\n" +
                "“दूध क्यों उफन जाता है ?\n" +
                "पानी क्यों बह जाता है ?\n" +
                "सब्जी क्यों जल जाती है ?”\n" +
                "\n" +
                "बीरबल ने जवाब दिया …..\n" +
                "\n" +
                "“व्हाटसअप चालू होने की वजह से”");
        mcount.add("06");

        initRecyclerView();


    }

    private void राजनीति() {
        mNames.add("कलियुग में यक्ष के प्रश्नों के उत्तर:-\uD83D\uDE0E\n" +
                "यक्ष :- पवन से भी तेज़ गति किसकी है ?\n" +
                "Me :- Airtel 4G.\n" +
                "यक्ष :- मृत्यु के समीप हुए व्यक्ति का सच्चा मित्र कौन है ?\n" +
                "Me :- जो मरने वाले का मोबाइल फॉर्मेट कर दे.\n" +
                "यक्ष :- पृथ्वी को किस वस्तु ने ढक रखा है ?\n" +
                "Me :- नरेंद्र मोदी की घोषणाओं ने.\n" +
                "यक्ष :- धरती पर ईश्वर का सबसे विचित्र अविष्कार क्या है ?\n" +
                "Me :- राहुल गाँधी.\n" +
                "यक्ष :- धरती पर ऐसी कौन सी मुसीबत है जिसका हल स्वयं ब्रह्मा जी के पास भी नहीं है ?\n" +
                "Me :- केजरीवाल की खांसी.\n" +
                "यक्ष :- कलयुग में नारद मुनि के सामान तीनों लोकों का ज्ञाता कौन है ?\n" +
                "Me :- गूगल बाबा.\n" +
                "यक्ष :- दुनिया में सबसे सुखी कौन है ?\n" +
                "Me :- विजय माल्या.\n" +
                "यक्ष :- लज्जा क्या है ?\n" +
                "Me :- माधुरी दीक्षित की फ़िल्म.\n" +
                "यक्ष :- दया क्या है ?\n" +
                "Me :- जेठालाल की पत्नी.\n" +
                "यक्ष :- मनुष्य किसके पीछे पागल है?\n" +
                "Me :- Reliance Jio के पीछे\n" +
                "इसके बाद से यक्ष अंकल कोमा में हैं\uD83D\uDE1C\n" +
                "होश में आते ही आगे की प्रश्नोत्तरी प्रकाशित की जाएगी..");
        mcount.add("01");
        mNames.add("नेता का बेटा: पापा मुझे भी राजनीति में आना है, मुझे कुछ टिप्स दो..\n" +
                "..\n" +
                "..\n" +
                "नेता: बेटा, राजनीति के तीन कठोर नियम होते हैं।\n" +
                "चलो पहला नियम समझाता हूं\n" +
                "..\n" +
                "..\n" +
                "यह कहकर नेताजी ने बेटे को छत पर भेज दिया\n" +
                "और खुद नीचे आकर खड़े हो गए…\n" +
                "नेताजी: छत से नीचे कूद जाओ\n" +
                "बेटा: पापा, इतनी ऊंचाई से कुदूंगा तो हाथ पैर टूट जाएंगे।\n" +
                "..\n" +
                "..\n" +
                "नेताजी: बेझिजक कूद जा,\n" +
                "मैं हूं न, पकड़ लूंगा।\n" +
                "..\n" +
                "..\n" +
                "लड़के ने हिम्मत की और कूद गया\n" +
                "पर नेताजी नीचे से हट गए,\n" +
                "बेटा धड़ाम से ओंधे मुंह गिरा\n" +
                "..\n" +
                "..\n" +
                "बेटा: (कराहते हुए बोला)\n" +
                "आपने तो कहा था मुझे पकडेंगे फिर हट क्यों गए ?\n" +
                "…\n" +
                "..\n" +
                "नेताजी: ये है पहला सबक\n" +
                "“राजनीति में अपने बाप का भी भरोसा मत करो”!! ");
        mcount.add("02");
        mNames.add("सुबह केजरीवाल के घर कुछ कुंवारे पहुंच गए,\n" +
                "यह कहते हुए कि हमें दुल्हन दे दीजिए…\n" +
                "परेशान केजरीवाल ने कहा:-\n" +
                "गधों हमने WI FI के लिए कहा था, न कि WIFE के लिए !!!");
        mcount.add("03");
        mNames.add("नेता की पत्नीः आपकी हार का मुख्य कारण क्या रहा?\n" +
                "नेताः मै शिकार हो गया था…\n" +
                "पत्नीः किस चीज का?\n" +
                "नेताः सही मतगणना का…!! \uD83D\uDE41");
        mcount.add("04");
        mNames.add("नेता का बेटा: पापा मुझे भी राजनीति में उतरना है, कुछ टिप्स दीजिए।\n" +
                "नेता: बेटा, राजनीति के तीन कठोर नियम होते हैं,\n" +
                "चलो पहला नियम समझाता हूँ…!!\n" +
                "(नेताजी ने बेटे को छत पर भेज दिया और ख़ुद नीचे आकर खड़े हो गए)\n" +
                "नेताजी: छत से नीचे कूद जाओ,\n" +
                "बेटा: पापा, इतनी ऊंचाई से कुदूंगा तो हाथ-पैर टूट जायेंगे।\n" +
                "नेताजी: बेझिजक कूद जा, में हूँ न, पकड़ लूँगा।\n" +
                "(लड़के ने हिम्मत की और कूद गया पर नेताजी नीचे से हट गए बेटा धडाम से औंधे मुंह गिरा)\n" +
                "बेटा: (कराहते हुए) आपने तो कहा था मुझे पकडेंगे फिर हट क्यों गए।\n" +
                "नेताजी: ये है पहला सबक- राजनीति में अपने पिता पर भी भरोसा मत करो…!!");
        mcount.add("05");
        mNames.add("नमतदाता (चुनाव लड़ रहे नेता से)\n" +
                "यह तो बताइए आप जीत गए तो क्या करेंगे?\n" +
                "नेताः भाई, मुझे तो चिंता इस बात की है कि\n" +
                "अगर हार गया तो क्या करूँगा!");
        mcount.add("06");
        mNames.add("नचुनाव की डेट फिक्स हो गई है…\n" +
                "अब पता चलेगा की मोहल्ले की\n" +
                "कौन सी लड़की १८ साल की हो गई है \uD83D\uDE00");
        mcount.add("07");
        mNames.add("मोदी – सोने की सभी चीजें जब्त की जाएँगी\n" +
                "राहुल गाँधी – ये मोदी पागल है क्या ?\n" +
                "सोनिया – क्यों\n" +
                "राहुल गाँधी – अरे मेरे रजाई गददे ने इसका क्या बिगाड़ा है\n" +
                "जो सोने की चीजें जब्त कर रहे हैं \uD83D\uDE42 \uD83D\uDE42");
        mcount.add("08");
        mNames.add("राहुल – मेरे को एक बात कहनी है\n" +
                "आलिया – बोल ना शर्माता क्यों है\n" +
                "राहुल – मेरे साथ कॉफी पे चलेगी\n" +
                "आलिया – नहीं बाबा\n" +
                "कॉफी गर्म होती है, मेरे पैर जल जायेंगे \uD83D\uDE42 \uD83D\uDE42");
        mcount.add("09");
        mNames.add("हुल गाँधी – मम्मी मैं बहुत टेंशन में हूँ आज\n" +
                "सोनिया – क्यों बेटा\n" +
                "राहुल – बैंको के बहार बहुत भीड़ है\n" +
                "इसलिए मै एक जगह छोटी लाइन देखकर खड़ा हो गया\n" +
                "सोनिया – अच्छा फिर\n" +
                "राहुल – आगे जाके पता चला वो साला\n" +
                "टॉयलेट के लिए लाइन लगी थी \uD83D\uDE42 \uD83D\uDE42");
        mcount.add("10");
        mNames.add("संजय दत्त ने अभी अभी प्रेस कॉन्फ्रेंस कर समाचार दिया है\n" +
                "“मुझे लोग सिर्फ प्यार से बाबा बुलाते है\n" +
                "मेरा कोई आश्रम नही है”\n" +
                "इस बीच राहुल गांधी ने कहा है.\n" +
                "मुझे राहुल बाबा ना कहें!!\n" +
                "मैं पप्पू ही ठीक हूं!");
        mcount.add("11");
        mNames.add("अगर आप अपने पिता जी की नहीं सुन रहे हैं …\n" +
                "तो आप\n" +
                "अखिलेश हैं\n" +
                "अगर आप अपने माता जी की नहीं सुन रहे हैं …\n" +
                "तो आप\n" +
                "राहुल हैं\n" +
                "अगर आप किसी की भी नहीं सुन रहे हैं …\n" +
                "तो आप\n" +
                "नरेंद्र मोदी हैं\n" +
                "अगर आपकी कोई नहीं सुन रहा है …\n" +
                "तो आप\n" +
                "केजरीवाल हैं!");
        mcount.add("12");
        mNames.add("‘अबकी बार मोदी सरकार’ सुन सुन के पक चुके हैं..!!\n" +
                "तो सुनिए कुछ नया…!!\n" +
                "सुरक्षित काले मेरे बाल,\n" +
                "पागल हो गया केजरीवाल..\n" +
                "च्यवनप्राश हो सोना चाँदी,\n" +
                "नही जीतेगा राहुल गाँधी..\n" +
                "…उपर छतरी निचे छाया..\n" +
                "भाग अखिलेश मोदी आया।");
        mcount.add("13");

        initRecyclerView();


    }

    private void मजेदार_चुटकुले() {
        mNames.add("भिखारी : साहब एक रुपया देदो।\n" +
                "साहब : कल आना।\n" +
                "भिखारी: साला इस कल कल के चक्कर में इस कालोनी में मेरे लाखों रु फंसे हुए हैं।");
        mcount.add("01");
        mNames.add("पत्नी: सुनो जी, आपको मुझ में सबसे ज्यादा क्या अच्छा लगया है, मेरी ब्यूटी या मेरी आक्लमंदी?\n" +
                "पति: मुझे तेरी यह मजाक करने की आदत बहुत अच्छी लगती है।\n" +
                "\n");
        mcount.add("02");
        mNames.add("मुन्ना भाई: अरे सरकिट यह कुत्ते पूंछ क्यों हिलाते हैं?\n" +
                "सर्किट: कॉमन सेंस है भाई, अब पूंछ कुत्ते को नहीं हिला सकती है ना।");
        mcount.add("03");
        mNames.add("मुन्ना भाई: एक बकरा तालाब में गिर गया है अब वो साला कैसे बाहर आयेगा?\n" +
                "सर्किट: भाई गीला हो कर। टैंशन नहीं लेने का।");
        mcount.add("04");




        initRecyclerView();


    }

    private void joke_18() {
        mNames.add("एक गुब्बारे वाले की दुकान के बाहर लिखा था:\n" +
                "    अगर अपने बच्चों को गुब्बारा नहीं दिला सकते तो वक्त पे गुब्बारा चढ़ा लिया करो।");
        mcount.add("01");
        mNames.add("पप्पू – भाई कल मेरी GF का बर्थडे है उसको क्या दूँ?\n" +
                " सच्चा दोस्त – भाई उसको लंड दे दे अपना।\n" +
                " पप्पू – यार मुझे उसे कुछ बड़ा गिफ्ट देना है।\n" +
                " सच्चा दोस्त – तो उसको मेरा लंड दे दे \n" +
                "\n" );
        mcount.add("02");

        mNames.add("रात भर सेक्स करने के बाद एक थॅकी औरत सुबह पड़ोस के हकीम के पास गयी और\n" +
                " बोली:- हकीम साहब, मेरे पति को सेक्स की गोली तुमने दी थी ना? हकीम खुश होते हुए:- हाँ ! .. ..\n" +
                " औरत:- तो बीवी भी फिर अपनी ही दे देता… मादरचौद.!!!\n" +
                "\n");
        mcount.add("03");
        mNames.add("हिंदी की मैडम ने कहा, \n" +
                "बच्चो – “बादल बरसे आँगन में” पर कविता लिखो।\n" +
                " एक बच्चे ने लिखा –\n" +
                " एक हमारी प्यारी मैडम\n" +
                " मस्ती भरे इस यौवन में\n" +
                " शाम हुई जब पिया घर आये \n" +
                "खाट बिछाया आँगन में \n" +
                "लब चुसे, स्तन दबाये \n" +
                "और लिंग घुसाया जांघन में \n" +
                "वो झूम झूम कर चुद गयी \n" +
                "“जब बादल बरसे आँगन में”\n" +
                "\n" );
        mcount.add("04");

        mNames.add("हिंदी की मैडम ने कहा, \n" +
                "बच्चो – “बादल बरसे आँगन में” पर कविता लिखो।\n" +
                " एक बच्चे ने लिखा –\n" +
                " एक हमारी प्यारी मैडम\n" +
                " मस्ती भरे इस यौवन में\n" +
                " शाम हुई जब पिया घर आये \n" +
                "खाट बिछाया आँगन में \n" +
                "लब चुसे, स्तन दबाये \n" +
                "और लिंग घुसाया जांघन में \n" +
                "वो झूम झूम कर चुद गयी \n" +
                "“जब बादल बरसे आँगन में”\n" +
                "\n" );
        mcount.add("04");






        initRecyclerView();


    }

    //english


    private void Bar_joke() {
        mNames.add("A man, his son and a dog walk into a bar.\n" +
                "\"Ow!\"\n" +
                "\"Ow!\"\n" +
                "\"Woof!\"");
        mcount.add("01");
        mNames.add("A guy walks into a bar -- and sustains a mild concussion." );
        mcount.add("02");

        mNames.add("A man walks into a bar and sees his friend sitting beside a 12-inch pianist. He says to his friend, \"That's amazing. How did you get that?\"\n" +
                "The man pulls out a bottle and tells him to rub it and make a wish. He rubs the bottle, and a puff of smoke pops out and tells him that he can have one wish. So the man thinks and says, \"I wish I had a million bucks.\"\n" +
                "The genie says, \"OK, go outside, and your wish will be granted.\"\n" +
                "The man goes outside, but all he finds are ducks filling the sky and roads. He goes back in and tells his friend what happend, and his friend replies, \"I know. Did you really think I wanted a 12-inch pianist?\"");
        mcount.add("03");
        mNames.add("A string walks into a bar with a few friends and orders a beer. The bartender says, \"I'm sorry, but we don't serve strings here.\"\n" +
                "\n" +
                "The string goes back to his table. He ties himself in a loop and messes up the top of his hair. He walks back up to the bar and orders a beer.\n" +
                "\n" +
                "The bartender squints at him and says, \"Hey, aren't you a string?\"\n" +
                "\n" +
                "The string says, \"Nope, I'm a frayed knot.\"" );
        mcount.add("04");

        mNames.add("हिA man walks into a bar and orders three beers.\n" +
                "\n" +
                "The bartender brings him the three beers, and the man proceeds to alternately sip one, then the other, then the third, until they're gone.\n" +
                "\n" +
                "He then orders three more and the bartender says, \"Sir, I know you like them cold, so you can start with one, and I'll bring you a fresh one as soon as you're low.\"\n" +
                "\n" +
                "The man says, \"You don't understand. I have two brothers, one in Australia and one in the Ireland. We made a vow to each other that every Saturday night, we'd still drink together. So right now, my brothers have three beers, too, and we're drinking together.\"\n" +
                "\n" +
                "The bartender thinks it's a wonderful tradition, and every week he sets up the guy's three beers. Then one week, the man comes in and orders only two. He drinks them and then orders two more. The bartender says sadly, \"Knowing your tradition, I'd just like to just say that I'm sorry you've lost a brother.\"\n" +
                "\n" +
                "The man replies, \"Oh, my brothers are fine -- I just quit drinking.\"" );
        mcount.add("04");



        initRecyclerView();


    }

    private void Funniest_jokes() {
        mNames.add("भDoctor: \"I'm sorry but you suffer from a terminal illness and have only 10 to live.\" Patient: \"What do you mean, 10? 10 what? Months? Weeks?!\" Doctor: \"Nine.\"");
        mcount.add("01");
        mNames.add("Mother: \"How was school today, Patrick?\" Patrick: \"It was really great mum! Today we made explosives!\" Mother: \"Ooh, they do very fancy stuff with you these days. And what will you do at school tomorrow?\" Patrick: \"What school? ");
        mcount.add("02");





        initRecyclerView();


    }






        private void initRecyclerView(){
        Log.d(TAG, "initRecyclerView: init recyclerview.");
        RecyclerView recyclerView = findViewById(R.id.recyclerv_view12);
        JokeAdapter adapter = new JokeAdapter(this, mNames,mcount);
        recyclerView.setAdapter(adapter);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));
    }
}
